name: "gpt2"
platform: "onnxruntime_onnx"
backend: "onnxruntime"

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [-1, -1]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [-1, -1, 50257]
  }
]
instance_group [
  {
    kind: KIND_CPU
  }
]
